<template>
    <Container class="about section-mt-l">
        <p class="about-text">
            <span v-for="part in texts">{{ part }}</span>
        </p>
        <div class="about-img">
            <img src="/forest/about/1.jpg" alt="">
        </div>
    </Container>
</template>

<script setup lang="ts">
import Container from '@/components/shared/container/Container.vue';

const texts = [
    `Загородный молодежный центр «Лесная сказка» - это структурное подразделение государственного бюджетного учреждения Самарской области «Агентство по реализации молодежной политики», в котором круглогодично проводятся детские и молодежные профильные выезды, тренинги, питчинг-сессии.`,
    `Центр был построен в 70-е годы XX века как пионерлагерь для нефтегазодобывающего управления «Первомайнефть».`,
    `В 2021-2022 годах молодежный центр был капитально отремонтирован и оснащен современным оборудованием, став полноправным региональным аналогом Мастерской управления «Сенеж».`,
    `Одномоментно Лесная сказка способна принять у себя 300 талантливых представителей молодежи Самарской области. А в год, ее посетителями становятся более 5 тысяч человек.`,
    `На территории Лесной сказки расположены спальные корпуса, полоса препятствий, волейбольная площадка и площадка для сдачи ГТО, шатры и площадки для проведения мероприятий.`,
    `После модернизации на базе инфраструктуры Лесной сказки были проведены десятки мероприятий, среди которых Военно – исторический лагерь «Страна героев», выезды Движения первых, профильные треки проектов «Кузница кадров» и «Амбассадоры активности», очный этап конкурса «Студент года» и многие другие.`,
]
</script>

<style scoped lang="scss">
.about {
    display: grid;
    grid-template-columns: 868px 788px;
    grid-template-rows: 694px;
    gap: 97px;

    &-text {
        font-size: 26px;
        line-height: 30px;
        display: flex;
        flex-direction: column;
        gap: 8px;
    }

    &-img {
        width: 100%;
        height: 100%;
        border-radius: 24px;
        overflow: hidden;

        img {
            width: 100%;
            height: 100%;
        }
    }
}
</style>