<template>
    <div class="mso section-mt-s">
        <div class="mso-desc">
            <p>
                Молодёжь Самарской области — сообщество, объединяющее всех молодых людей региона. Это бренд, медиа, а
                также
                комьюнити, которое рассказывает о всех событиях и возможностях, создаваемых для и от молодых людей
                Самарской
                области.
                Главный посыл МСО — это жить, творить, любить и учиться в сердце России. Мы учим любить регион в форме
                сердца и оставаться в нем его развивать. Говорим про науку, студвесну, форумы, труд, семью, любовь к
                Родине
                и многое другое.
            </p>
            <div>
                <img src="/forest/mso/1.png" alt="">
            </div>
        </div>
        <div class="mso-projects">
            <h2 class="title-card title-card_primary">Флагманские проекты МСО</h2>
            <div class="mso-projects-items">
                <div class="mso-projects-items__item" v-for="item in data">
                    <div class="mso-projects-items__item-img">
                        <img :src="item.img" alt="">
                    </div>
                    <div class="mso-projects-items__item-text-content">
                        <p class="title-card title-card_secondary">
                            {{ item.title }}
                        </p>
                        <button class="btn btn-secondary" @click="onClick(item)">Подробнее</button>
                    </div>
                </div>
            </div>
        </div>
    </div>
</template>

<script setup lang="ts">
import { useRouter } from 'vue-router';


const data = [
    {
        title: 'Областной фестиваль студенческого творчества «Самарская студенческая весна»',
        desc: `Время проведения: март-май
Фестиваль студенческого творчества «Самарская студенческая весна» традиционно проводится на территории Самарской области в рамках реализации Программы поддержки и развития студенческого творчества «Российская студенческая весна» и является региональным этапом Всероссийского фестиваля «Российская студенческая весна».
Ежегодно фестиваль объединяет более 1000 творческих студентов Самарской области, показывает нам более 15-ти концертных программ от вузов и дарит крутой итоговый гала-концерт!
В Самарской области студенческая весна существует с 1952 года. Идея реализации проекта «Российская студенческая весна» появилась на территории Самарского региона в 1992 году, а с 1993 года данный проект был поддержан Российским Союзом Молодёжи и приобрел статус всероссийского Фестиваля.
В 2022 году Самарская область – родина Российской студенческой весны – принимала юбилейный фестиваль, который объединил на нашей гостеприимной волжской земле 5 000 участников и гостей из 85 регионов страны, а также делегации ДНР, ЛНР и стран СНГ.
Фестиваль стал рекордным по своим масштабам и уникальным по формату проведения. Частью невероятного праздника молодежи и творчества стали сотни тысяч жителей и гостей нашей губернии.
Впервые в юбилейный год Студвесна вышла за рамки закрытых сценических площадок, подарив настоящий праздник гостям и жителям региона. За дни проведения фестиваля конкурсные площадки посетили более 120 тысяч жителей Самарской области, а «Фестивальные городки» – порядка 650 тысяч человек.`,
        img: '/forest/mso/1.png'
    },
    {
        title: 'Областной фестиваль студенческого творчества «Самарская студенческая весна»',
        desc: `Время проведения: март-май
Фестиваль студенческого творчества «Самарская студенческая весна» традиционно проводится на территории Самарской области в рамках реализации Программы поддержки и развития студенческого творчества «Российская студенческая весна» и является региональным этапом Всероссийского фестиваля «Российская студенческая весна».
Ежегодно фестиваль объединяет более 1000 творческих студентов Самарской области, показывает нам более 15-ти концертных программ от вузов и дарит крутой итоговый гала-концерт!
В Самарской области студенческая весна существует с 1952 года. Идея реализации проекта «Российская студенческая весна» появилась на территории Самарского региона в 1992 году, а с 1993 года данный проект был поддержан Российским Союзом Молодёжи и приобрел статус всероссийского Фестиваля.
В 2022 году Самарская область – родина Российской студенческой весны – принимала юбилейный фестиваль, который объединил на нашей гостеприимной волжской земле 5 000 участников и гостей из 85 регионов страны, а также делегации ДНР, ЛНР и стран СНГ.
Фестиваль стал рекордным по своим масштабам и уникальным по формату проведения. Частью невероятного праздника молодежи и творчества стали сотни тысяч жителей и гостей нашей губернии.
Впервые в юбилейный год Студвесна вышла за рамки закрытых сценических площадок, подарив настоящий праздник гостям и жителям региона. За дни проведения фестиваля конкурсные площадки посетили более 120 тысяч жителей Самарской области, а «Фестивальные городки» – порядка 650 тысяч человек.`,
        img: '/forest/mso/1.png'
    },
    {
        title: 'Областной фестиваль студенческого творчества «Самарская студенческая весна»',
        desc: `Время проведения: март-май
Фестиваль студенческого творчества «Самарская студенческая весна» традиционно проводится на территории Самарской области в рамках реализации Программы поддержки и развития студенческого творчества «Российская студенческая весна» и является региональным этапом Всероссийского фестиваля «Российская студенческая весна».
Ежегодно фестиваль объединяет более 1000 творческих студентов Самарской области, показывает нам более 15-ти концертных программ от вузов и дарит крутой итоговый гала-концерт!
В Самарской области студенческая весна существует с 1952 года. Идея реализации проекта «Российская студенческая весна» появилась на территории Самарского региона в 1992 году, а с 1993 года данный проект был поддержан Российским Союзом Молодёжи и приобрел статус всероссийского Фестиваля.
В 2022 году Самарская область – родина Российской студенческой весны – принимала юбилейный фестиваль, который объединил на нашей гостеприимной волжской земле 5 000 участников и гостей из 85 регионов страны, а также делегации ДНР, ЛНР и стран СНГ.
Фестиваль стал рекордным по своим масштабам и уникальным по формату проведения. Частью невероятного праздника молодежи и творчества стали сотни тысяч жителей и гостей нашей губернии.
Впервые в юбилейный год Студвесна вышла за рамки закрытых сценических площадок, подарив настоящий праздник гостям и жителям региона. За дни проведения фестиваля конкурсные площадки посетили более 120 тысяч жителей Самарской области, а «Фестивальные городки» – порядка 650 тысяч человек.`,
        img: '/forest/mso/1.png'
    },
]

const router = useRouter()

const onClick = (data) => {
    router.push({ path: `mso/${data.id}`, state: { data } })
};

</script>

<style scoped lang="scss">
.title-card {
    text-align: left;
}

.mso {
    display: grid;
    grid-template-columns: 720px 868px;
    gap: 173px;

    &-desc {
        display: flex;
        flex-direction: column;
        justify-content: space-between;
        font-size: 26px;

        &-img {
            border-radius: 24px;
            overflow: hidden;

            img {
                width: 100%;
                height: 100%;
                object-fit: cover;
            }
        }
    }

    &-projects {
        display: flex;
        flex-direction: column;
        gap: 57px;

        h2 {
            width: fit-content;
            font-size: 26px;
        }

        &-items {
            display: flex;
            flex-direction: column;
            justify-content: space-between;
            gap: 24px;

            &__item {
                display: flex;
                align-items: center;
                gap: 35px;
                border-radius: 24px;
                height: 216px;
                padding: 20px;
                background-color: var(--color-gray);

                &-img {
                    width: 300px;
                    flex-shrink: 0;
                    height: 100%;
                    overflow: hidden;
                    border-radius: 24px;

                    img {
                        width: 100%;
                        height: 100%;
                        object-fit: cover;
                    }
                }

                &-text-content {
                    display: flex;
                    flex-direction: column;
                    gap: 16px;
                }
            }
        }

    }
}
</style>